gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
/**
  *********************************************************************************************************
  * @file    platform_map.c
  * @author  Movebroad -- KK
  * @version V1.0
  * @date    2018-03-24
  * @brief   
  *********************************************************************************************************
  * @attention
  *			
  *
  *
  *********************************************************************************************************
  */

#include "platform_map.h"
#include "stm32l1xx_config.h"
#include "hal_eeprom.h"
#include "hal_vbat.h"
#include "hal_temperature.h"
#include "hal_spiflash.h"
#include "radar_api.h"
#include "radio_hal_rf.h"
#include "radio_rf_app.h"
#include "inspectmessageoperate.h"
#include "string.h"

TCFG_SystemDataTypeDef			TCFG_SystemData;

#if NETPROTOCAL == NETCOAP
/**********************************************************************************************************
 @Function			static void TCFG_EEPROM_Write_CoAPCDPAddr(void)
 @Description			TCFG_EEPROM_Write_CoAPCDPAddr					: 写入CoAP CDP Addr
 @Input				void
 @Return				void
**********************************************************************************************************/
static void TCFG_EEPROM_Write_CoAPCDPAddr(void)
{
	int serverip[4];
	
	sscanf(COAPCDPADDR, "%d.%d.%d.%d", &serverip[3], &serverip[2], &serverip[1], &serverip[0]);
	TCFG_SystemData.NBCoapCDPServer.ip.ip8[3] = serverip[3];
	TCFG_SystemData.NBCoapCDPServer.ip.ip8[2] = serverip[2];
	TCFG_SystemData.NBCoapCDPServer.ip.ip8[1] = serverip[1];
	TCFG_SystemData.NBCoapCDPServer.ip.ip8[0] = serverip[0];
	TCFG_SystemData.NBCoapCDPServer.port = COAPCDPPORT;
	TCFG_EEPROM_SetServerIP(TCFG_SystemData.NBCoapCDPServer.ip.ip32);
	TCFG_EEPROM_SetServerPort(TCFG_SystemData.NBCoapCDPServer.port);
}
#endif

#if NETPROTOCAL == NETMQTTSN
/**********************************************************************************************************
 @Function			static void TCFG_EEPROM_Write_MqttSNServerAddr(void)
 @Description			TCFG_EEPROM_Write_MqttSNServerAddr				: 写入MqttSN Server Addr
 @Input				void
 @Return				void
**********************************************************************************************************/
static void TCFG_EEPROM_Write_MqttSNServerAddr(void)
{
	int serverip[4];
	
	sscanf(MQTTSN_SERVER_HOST_IP, "%d.%d.%d.%d", &serverip[3], &serverip[2], &serverip[1], &serverip[0]);
	TCFG_SystemData.NBMqttSNServer.ip.ip8[3] = serverip[3];
	TCFG_SystemData.NBMqttSNServer.ip.ip8[2] = serverip[2];
	TCFG_SystemData.NBMqttSNServer.ip.ip8[1] = serverip[1];
	TCFG_SystemData.NBMqttSNServer.ip.ip8[0] = serverip[0];
	TCFG_SystemData.NBMqttSNServer.port = MQTTSN_SERVER_TELE_PORT;
	TCFG_EEPROM_SetMqttSNIP(TCFG_SystemData.NBMqttSNServer.ip.ip32);
	TCFG_EEPROM_SetMqttSNPort(TCFG_SystemData.NBMqttSNServer.port);
}
#endif

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SystemInfo_Init(void)
 @Description			TCFG_EEPROM_SystemInfo_Init					: 系统信息初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SystemInfo_Init(void)
{
	TCFG_EEPROM_ReadConfigData();
	TCFG_EEPROM_SetBootMode(TCFG_ENV_BOOTMODE_NORMAL);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_WriteConfigData(void)
 @Description			TCFG_EEPROM_WriteConfigData					: 写入系统配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_WriteConfigData(void)
{
	char vender[4];
	unsigned int Brand = 0;
	
	/* 生产商与设备号 */
	TCFG_EEPROM_SetSNfromBrandKey(TCFG_EEPROM_Get_MAC_SN());
	TCFG_EEPROM_GetVender(vender);
	Brand |= (vender[0] & 0x000000FF) << 3*8;
	Brand |= (vender[1] & 0x000000FF) << 2*8;
	Brand |= (vender[2] & 0x000000FF) << 1*8;
	Brand |= (vender[3] & 0x000000FF) << 0*8;
	TCFG_EEPROM_SetFactoryBrand(Brand);
	
	/* 传感器灵敏度值 */
	TCFG_SystemData.Sensitivity = SENSE_MIDDLE;
	TCFG_EEPROM_SetSavedSensitivity(TCFG_SystemData.Sensitivity);
	
	/* 覆水低频点增益 */
	TCFG_SystemData.CoverGain = RADAR_COVERGAIN_DEFAULT;
	TCFG_EEPROM_SetCoverGain(TCFG_SystemData.CoverGain);
	
	/* 雷达整体增益 */
	TCFG_SystemData.RadarGain = TRADAR_GAIN_DEFAULT;
	TCFG_EEPROM_SetRadarGain(TCFG_SystemData.RadarGain);
	
	/* 地磁背景值 */
	TCFG_SystemData.MagBackgroundX = 0x7FFF;
	TCFG_SystemData.MagBackgroundY = 0x7FFF;
	TCFG_SystemData.MagBackgroundZ = 0x7FFF;
	TCFG_EEPROM_SetMagBackgroud(TCFG_SystemData.MagBackgroundX, TCFG_SystemData.MagBackgroundY, TCFG_SystemData.MagBackgroundZ);
	
	/* 地磁背景温度补偿值 */
	TCFG_SystemData.MagBackgroudTemp = 0;
	TCFG_EEPROM_SetMagBackgroudTemp(TCFG_SystemData.MagBackgroudTemp);
	
	/* 地磁温飘计算值 */
	TCFG_SystemData.MagCoefX = 0;
	TCFG_SystemData.MagCoefY = 0;
	TCFG_SystemData.MagCoefZ = 0;
	TCFG_EEPROM_SetMagTempCoef(TCFG_SystemData.MagCoefX, TCFG_SystemData.MagCoefY, TCFG_SystemData.MagCoefZ);
	
	/* 设备工作模式 */
	TCFG_SystemData.WorkMode = NORMAL_WORK;
	TCFG_EEPROM_SetWorkMode(TCFG_SystemData.WorkMode);
	
	/* 无线通道选择 */
	TCFG_SystemData.RFChannel = RADIO_RF_CHANNEL1;
	TCFG_EEPROM_SetRfChannel(TCFG_SystemData.RFChannel);
	
	/* 无线心跳间隔 */
	TCFG_SystemData.Heartinterval = HEART_INTERVAL;
	TCFG_EEPROM_SetHeartinterval(TCFG_SystemData.Heartinterval);
	
	/* 无线调试输出等级 */
	TCFG_SystemData.RFDprintLv = RF_DPRINT_LV_TYPE;
	TCFG_EEPROM_SetRFDprintLv(TCFG_SystemData.RFDprintLv);
	
	/* 地磁模式 */
	TCFG_SystemData.MagMode = 0;
	TCFG_EEPROM_SetMagMode(TCFG_SystemData.MagMode);
	
	/* 传感器模式 */
	TCFG_SystemData.SenseMode = TRADAR_SENSE_BOTH;
	TCFG_EEPROM_SetSenseMode(TCFG_SystemData.SenseMode);
	
	/* 雷达次数 */
	TCFG_SystemData.RadarCount = 0;
	TCFG_EEPROM_SetRadarCount(TCFG_SystemData.RadarCount);
	
	/* 雷达检测范围 */
	TCFG_SystemData.RadarRange = 0;
	TCFG_EEPROM_SetRadarRange(TCFG_SystemData.RadarRange);
	
	/* 车辆进入延时上报时间 */
	TCFG_SystemData.CarInDelay = 8;
	TCFG_EEPROM_SetCarInDelay(TCFG_SystemData.CarInDelay);
	
	/* 车位检测车辆次数 */
	TCFG_SystemData.SpotStatusCount = 0;
	TCFG_EEPROM_SetStatusCount(TCFG_SystemData.SpotStatusCount);
	
	/* 设备重启次数 */
	TCFG_SystemData.DeviceBootCount = 0;
	TCFG_EEPROM_SetDevBootCnt(TCFG_SystemData.DeviceBootCount);
	
	/* NBIot心跳间隔 */
	TCFG_SystemData.NBIotHeart = NBIOT_HEART_DATA_HOURS;
	TCFG_EEPROM_SetNbiotHeart(TCFG_SystemData.NBIotHeart);
	
	/* NBIot重启次数 */
	TCFG_SystemData.NBIotBootCount = 0;
	TCFG_EEPROM_SetNbiotBootCnt(TCFG_SystemData.NBIotBootCount);
	
	/* NBIot Coap 接收数据次数 */
	TCFG_SystemData.CoapRecvCount = 0;
	TCFG_EEPROM_SetCoapRecvCnt(TCFG_SystemData.CoapRecvCount);
	
	/* NBIot Coap 发送数据次数 */
	TCFG_SystemData.CoapSentCount = 0;
	TCFG_EEPROM_SetCoapSentCnt(TCFG_SystemData.CoapSentCount);
	
