gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	/* NBIot MqttSN 接收数据次数 */
	TCFG_SystemData.MqttSNRecvCount = 0;
	TCFG_EEPROM_SetMqttSNRecvCnt(TCFG_SystemData.MqttSNRecvCount);
	
	/* NBIot MqttSN 发送数据次数 */
	TCFG_SystemData.MqttSNSentCount = 0;
	TCFG_EEPROM_SetMqttSNSentCnt(TCFG_SystemData.MqttSNSentCount);
	
	/* NBIot OneNET 接收数据次数 */
	TCFG_SystemData.OneNETRecvCount = 0;
	TCFG_EEPROM_SetOneNETRecvCnt(TCFG_SystemData.OneNETRecvCount);
	
	/* NBIot OneNET 发送数据次数 */
	TCFG_SystemData.OneNETSentCount = 0;
	TCFG_EEPROM_SetOneNETSentCnt(TCFG_SystemData.OneNETSentCount);
	
	/* RF命令接收条数 */
	TCFG_SystemData.RFCommandCount = 0;
	TCFG_EEPROM_SetRFCmdCnt(TCFG_SystemData.RFCommandCount);
	
	/* NB命令接收条数 */
	TCFG_SystemData.NBCommandCount = 0;
	TCFG_EEPROM_SetNBCmdCnt(TCFG_SystemData.NBCommandCount);
	
	/* Coap间隔时间发送普通数据包用于接收下行数据 */
	TCFG_SystemData.CoapRATimeHour = NBCOAP_RATIME_NORMAL_TYPE;
	TCFG_EEPROM_SetCoapRATimeHour(TCFG_SystemData.CoapRATimeHour);
	
	/* Coap保持连接时间 */
	TCFG_SystemData.CoapConnectTime = 0;
	TCFG_EEPROM_SetCoapConnectTime(TCFG_SystemData.CoapConnectTime);
	
	/* Coap休眠时间 */
	TCFG_SystemData.CoapIdleTime = 0;
	TCFG_EEPROM_SetCoapIdleTime(TCFG_SystemData.CoapIdleTime);
	
	/* 升级信号值限制下限 */
	TCFG_SystemData.UpgradeLimitRssi = NBCOAP_PCP_UPGRADE_LIMIT_RSSI;
	TCFG_EEPROM_SetUpgradeLimitRssi(TCFG_SystemData.UpgradeLimitRssi);
	
	/* 升级信号质量限制下限 */
	TCFG_SystemData.UpgradeLimitSnr = NBCOAP_PCP_UPGRADE_LIMIT_SNR;
	TCFG_EEPROM_SetUpgradeLimitSnr(TCFG_SystemData.UpgradeLimitSnr);
	
	/* 蜂鸣器控制 */
	TCFG_SystemData.BeepCtrlOff = 0;
	TCFG_EEPROM_SetBeepOff(TCFG_SystemData.BeepCtrlOff);
	
	/* 设备重启方式 */
	TCFG_SystemData.DeviceRbtMode = RBTMODE_MODE_NONE;
	TCFG_EEPROM_SetDeviceRbtMode(TCFG_SystemData.DeviceRbtMode);
	
	/* NB核心网地址 */
#if NETPROTOCAL == NETCOAP
	TCFG_EEPROM_Write_CoAPCDPAddr();
#endif
	
	/* MqttSN服务器地址 */
#if NETPROTOCAL == NETMQTTSN
	TCFG_EEPROM_Write_MqttSNServerAddr();
#endif
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_ReadConfigData(void)
 @Description			TCFG_EEPROM_ReadConfigData					: 读取系统配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_ReadConfigData(void)
{
	/* 获取SubSN */
	TCFG_SystemData.SubSn = TCFG_EEPROM_Get_MAC_SN();
	TCFG_EEPROM_Get_MAC_SN_String();
	
	/* 获取传感器灵敏度值 */
	TCFG_SystemData.Sensitivity = TCFG_EEPROM_GetSavedSensitivity();
	if ((TCFG_SystemData.Sensitivity > SENSE_LOWEST) || (TCFG_SystemData.Sensitivity < SENSE_HIGHEST)) {
		TCFG_SystemData.Sensitivity = SENSE_MIDDLE;
		TCFG_EEPROM_SetSavedSensitivity(TCFG_SystemData.Sensitivity);
	}
	
	/* 获取雷达覆盖时的增益值 */
	TCFG_SystemData.CoverGain = TCFG_EEPROM_GetCoverGain();
	if ((TCFG_SystemData.CoverGain < RADAR_COVERGAIN_LOW) || (TCFG_SystemData.CoverGain > RADAR_COVERGAIN_HIGH)) {
		TCFG_SystemData.CoverGain = RADAR_COVERGAIN_DEFAULT;
		TCFG_EEPROM_SetCoverGain(TCFG_SystemData.CoverGain);
	}
	
	/* 获取雷达增益值 */
	TCFG_SystemData.RadarGain = TCFG_EEPROM_GetRadarGain();
	if ((TCFG_SystemData.RadarGain > TRADAR_GAIN_HIGHEST) || (TCFG_SystemData.RadarGain < TRADAR_GAIN_LOWEST)) {
		TCFG_SystemData.RadarGain = TRADAR_GAIN_DEFAULT;
		TCFG_EEPROM_SetRadarGain(TCFG_SystemData.RadarGain);
	}
	
	/* 获取BOOT版本号 */
	TCFG_SystemData.BootVersion = TCFG_EEPROM_GetBootVersion();
	
	/* 地磁背景值 */
	TCFG_SystemData.MagBackgroundX = TCFG_EEPROM_GetMagBackgroud(TCFG_X_AXIS);
	TCFG_SystemData.MagBackgroundY = TCFG_EEPROM_GetMagBackgroud(TCFG_Y_AXIS);
	TCFG_SystemData.MagBackgroundZ = TCFG_EEPROM_GetMagBackgroud(TCFG_Z_AXIS);
	
	/* 写入背景值 */
	memset((void*)&Qmc5883lData, 1, sizeof(Qmc5883lData));
	Qmc5883lData.X_Back = TCFG_SystemData.MagBackgroundX;
	Qmc5883lData.Y_Back = TCFG_SystemData.MagBackgroundY;
	Qmc5883lData.Z_Back = TCFG_SystemData.MagBackgroundZ;
	
	/* 地磁背景温度补偿值 */
	TCFG_SystemData.MagBackgroudTemp = TCFG_EEPROM_GetMagBackgroudTemp();
	Qmc5883lData.temp_back = TCFG_SystemData.MagBackgroudTemp;
	
	/* 地磁温飘计算值 */
	TCFG_EEPROM_GetMagTempCoef(&TCFG_SystemData.MagCoefX, &TCFG_SystemData.MagCoefY, &TCFG_SystemData.MagCoefZ);
	Qmc5883lData.X_Coef = TCFG_SystemData.MagCoefX;
	Qmc5883lData.Y_Coef = TCFG_SystemData.MagCoefY;
	Qmc5883lData.Z_Coef = TCFG_SystemData.MagCoefZ;
	
	/* 获取设备工作模式 */
	TCFG_SystemData.WorkMode = TCFG_EEPROM_GetWorkMode();
	if ((TCFG_SystemData.WorkMode != DEBUG_WORK) && (TCFG_SystemData.WorkMode != NORMAL_WORK)) {
		TCFG_SystemData.WorkMode = NORMAL_WORK;
		TCFG_EEPROM_SetWorkMode(TCFG_SystemData.WorkMode);
	}
	
	/* 无线通道选择 */
	TCFG_SystemData.RFChannel = TCFG_EEPROM_GetRfChannel();
	RF_CHANNEL1 = TCFG_SystemData.RFChannel;
	
	/* 无线心跳间隔 */
	TCFG_SystemData.Heartinterval = TCFG_EEPROM_GetHeartinterval();
	if ((TCFG_SystemData.Heartinterval > 120) || (TCFG_SystemData.Heartinterval < 1)) {
		TCFG_SystemData.Heartinterval = HEART_INTERVAL;
		TCFG_EEPROM_SetHeartinterval(TCFG_SystemData.Heartinterval);
	}
	
	/* 无线调试输出等级 */
	TCFG_SystemData.RFDprintLv = TCFG_EEPROM_GetRFDprintLv();
	if (TCFG_SystemData.RFDprintLv == 0) {
		TCFG_SystemData.RFDprintLv = RF_DPRINT_LV_TYPE;
		TCFG_EEPROM_SetRFDprintLv(TCFG_SystemData.RFDprintLv);
	}
	
	/* 地磁模式 */
	TCFG_SystemData.MagMode = TCFG_EEPROM_GetMagMode();
	
	/* 传感器模式 */
	TCFG_SystemData.SenseMode = TCFG_EEPROM_GetSenseMode();
	
	/* 雷达次数 */
	TCFG_SystemData.RadarCount = TCFG_EEPROM_GetRadarCount();
	
	/* 雷达检测范围 */
	TCFG_SystemData.RadarRange = TCFG_EEPROM_GetRadarRange();
	
	/* 车辆进入延时上报时间 */
	TCFG_SystemData.CarInDelay = TCFG_EEPROM_GetCarInDelay();
	
	/* 车位检测车辆次数 */
	TCFG_SystemData.SpotStatusCount = TCFG_EEPROM_GetStatusCount();
	InspectSpotStatus.SpotStatus[InspectSpotStatus.Rear].spot_count = TCFG_SystemData.SpotStatusCount;
	
	/* 设备重启次数 */
	TCFG_SystemData.DeviceBootCount = TCFG_EEPROM_GetDevBootCnt() + 1;
	TCFG_EEPROM_SetDevBootCnt(TCFG_SystemData.DeviceBootCount);
	
	/* NBIot心跳间隔 */
	TCFG_SystemData.NBIotHeart = TCFG_EEPROM_GetNbiotHeart();
	if ((TCFG_SystemData.NBIotHeart == 0) || (TCFG_SystemData.NBIotHeart > 12)) {
		TCFG_SystemData.NBIotHeart = NBIOT_HEART_DATA_HOURS;
		TCFG_EEPROM_SetNbiotHeart(TCFG_SystemData.NBIotHeart);
	}
	
	/* NBIot重启次数 */
	TCFG_SystemData.NBIotBootCount = TCFG_EEPROM_GetNbiotBootCnt();
	
	/* NBIot Coap 接收数据次数 */
	TCFG_SystemData.CoapRecvCount = TCFG_EEPROM_GetCoapRecvCnt();
	
	/* NBIot Coap 发送数据次数 */
	TCFG_SystemData.CoapSentCount = TCFG_EEPROM_GetCoapSentCnt();
	
