gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	sval32 = Qmc5883lData.Y_Back*(10000+Qmc5883lData.Y_Coef*Qmc5883lData.temp_back)/(10000+coef_y*Qmc5883lData.temp_back);
	if (sval32 > 32767)
		Qmc5883lData.Y_Back = 32767;
	else if (sval32 < -32768)
		Qmc5883lData.Y_Back = -32768;
	else
		Qmc5883lData.Y_Back = sval32;
	
	sval32 = Qmc5883lData.Z_Back*(10000+Qmc5883lData.Z_Coef*Qmc5883lData.temp_back)/(10000+coef_z*Qmc5883lData.temp_back);
	if (sval32 > 32767)
		Qmc5883lData.Z_Back = 32767;
	else if (sval32 < -32768)
		Qmc5883lData.Z_Back = -32768;
	else
		Qmc5883lData.Z_Back = sval32;
	
	Qmc5883lData.X_Coef = coef_x;
	Qmc5883lData.Y_Coef = coef_y;
	Qmc5883lData.Z_Coef = coef_z;
	
	FLASH_EEPROM_WriteByte(TCFG_MAG_COEF_X_OFFSET, coef_x);
	FLASH_EEPROM_WriteByte(TCFG_MAG_COEF_Y_OFFSET, coef_y);
	FLASH_EEPROM_WriteByte(TCFG_MAG_COEF_Z_OFFSET, coef_z);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_GetMagTempCoef(signed char* coef_x, signed char* coef_y, signed char* coef_z)
 @Description			TCFG_EEPROM_GetMagTempCoef					: 读取地磁温飘计算值
 @Input				*coef_x
					*coef_y
					*coef_z
 @Return				val
**********************************************************************************************************/
void TCFG_EEPROM_GetMagTempCoef(signed char* coef_x, signed char* coef_y, signed char* coef_z)
{
	*coef_x = FLASH_EEPROM_ReadByte(TCFG_MAG_COEF_X_OFFSET);
	*coef_y = FLASH_EEPROM_ReadByte(TCFG_MAG_COEF_Y_OFFSET);
	*coef_z = FLASH_EEPROM_ReadByte(TCFG_MAG_COEF_Z_OFFSET);
	
	return ;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMagBackgroudTemp(short temp)
 @Description			TCFG_EEPROM_SetMagBackgroudTemp				: 保存MagBackgroudTemp
 @Input				temp
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMagBackgroudTemp(short temp)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_MAG_BACK_TEMP_OFFSET, temp);
}

/**********************************************************************************************************
 @Function			short TCFG_EEPROM_GetMagBackgroudTemp(void)
 @Description			TCFG_EEPROM_GetMagBackgroudTemp				: 读取MagBackgroudTemp
 @Input				void
 @Return				temp
**********************************************************************************************************/
short TCFG_EEPROM_GetMagBackgroudTemp(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_MAG_BACK_TEMP_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSubSN(unsigned int subsn)
 @Description			TCFG_EEPROM_SetSubSN						: 保存SubSN
 @Input				subsn
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSubSN(unsigned int subsn)
{
	FLASH_EEPROM_WriteWord(TCFG_SN_OFFSET, subsn);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetSubSN(void)
 @Description			TCFG_EEPROM_GetSubSN						: 读取SubSN
 @Input				void
 @Return				subsn
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetSubSN(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_SN_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetBrandCode(unsigned int brand)
 @Description			TCFG_EEPROM_SetBrandCode						: 保存BrandCode
 @Input				brand
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetBrandCode(unsigned int brand)
{
	FLASH_EEPROM_WriteWord(TCFG_SECU_BRAND_OFFSET, brand);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetBrandCode(void)
 @Description			TCFG_EEPROM_GetBrandCode						: 读取BrandCode
 @Input				void
 @Return				brand
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetBrandCode(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_SECU_BRAND_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetBootCount(unsigned char count)
 @Description			TCFG_EEPROM_SetBootCount						: 保存BootCount
 @Input				count
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetBootCount(unsigned char count)
{
	FLASH_EEPROM_WriteByte(TCFG_RECORD_BOOTCNT_OFFSET, count);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetBootCount(void)
 @Description			TCFG_EEPROM_GetBootCount						: 读取BootCount
 @Input				void
 @Return				count
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetBootCount(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RECORD_BOOTCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetServerIP(unsigned int val)
 @Description			TCFG_EEPROM_SetServerIP						: 保存ServerIP
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetServerIP(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_RECORD_SERVER_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetServerIP(void)
 @Description			TCFG_EEPROM_GetServerIP						: 读取ServerIP
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetServerIP(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_RECORD_SERVER_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetServerPort(unsigned short val)
 @Description			TCFG_EEPROM_SetServerPort					: 保存ServerPort
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetServerPort(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_RECORD_SERVER_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetServerPort(void)
 @Description			TCFG_EEPROM_GetServerPort					: 读取ServerPort
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetServerPort(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_RECORD_SERVER_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_ServerIP_String(void)
 @Description			TCFG_EEPROM_Get_ServerIP_String				: 读取ServerIP字符串
 @Input				void
 @Return				ServerIP_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_ServerIP_String(void)
{
	TCFG_SystemData.NBCoapCDPServer.ip.ip32 = TCFG_EEPROM_GetServerIP();
	
