gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
exit:
	return ret;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSNfromBrandKey(unsigned int val)
 @Description			TCFG_EEPROM_SetSNfromBrandKey					: 保存SNfromBrandKey
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSNfromBrandKey(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_BRAND_SN_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetSNfromBrandKey(void)
 @Description			TCFG_EEPROM_GetSNfromBrandKey					: 读取SNfromBrandKey
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetSNfromBrandKey(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_BRAND_SN_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetFactoryBrand(unsigned int val)
 @Description			TCFG_EEPROM_SetFactoryBrand					: 保存FactoryBrand
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetFactoryBrand(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_BRAND_SN_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetFactoryBrand(void)
 @Description			TCFG_EEPROM_GetFactoryBrand					: 读取FactoryBrand
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetFactoryBrand(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_BRAND_SN_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_Set_MAC_SN(unsigned int subsn)
 @Description			TCFG_EEPROM_Set_MAC_SN						: 保存MAC SN
 @Input				sn
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_Set_MAC_SN(unsigned int sn)
{
	unsigned int subsn = 0;
	
	subsn |= (sn & 0xFF000000) >> 3*8;
	subsn |= (sn & 0x00FF0000) >> 1*8;
	subsn |= (sn & 0x0000FF00) << 1*8;
	subsn |= (sn & 0x000000FF) << 3*8;
	
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_MAC_SN_OFFSET, subsn);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_Get_MAC_SN(void)
 @Description			TCFG_EEPROM_Get_MAC_SN						: 读取MAC SN
 @Input				void
 @Return				sn
**********************************************************************************************************/
unsigned int TCFG_EEPROM_Get_MAC_SN(void)
{
	unsigned int subsn = 0;
	unsigned int sn = 0;
	
	subsn = FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
	sn |= (subsn & 0xFF000000) >> 3*8;
	sn |= (subsn & 0x00FF0000) >> 1*8;
	sn |= (subsn & 0x0000FF00) << 1*8;
	sn |= (subsn & 0x000000FF) << 3*8;
	
	sn = (sn == 0) ? 1 : sn;
	
	return sn;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MAC_SN_String(void)
 @Description			TCFG_EEPROM_Get_MAC_SN_String					: 读取MAC SN字符串
 @Input				void
 @Return				sn_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MAC_SN_String(void)
{
	unsigned int subsn = 0;
	unsigned int sn = 0;
	
	subsn = FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
	sn |= (subsn & 0xFF000000) >> 3*8;
	sn |= (subsn & 0x00FF0000) >> 1*8;
	sn |= (subsn & 0x0000FF00) << 1*8;
	sn |= (subsn & 0x000000FF) << 3*8;
	
	sn = (sn == 0) ? 1 : sn;
	
	memset((void *)TCFG_SystemData.SubMacSN, 0x0, sizeof(TCFG_SystemData.SubMacSN));
	sprintf((char*)TCFG_SystemData.SubMacSN, "%08x", sn);
	
	return (char*)TCFG_SystemData.SubMacSN;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetVender(char* vender)
 @Description			TCFG_EEPROM_SetVender						: 保存vender
 @Input				&vender
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetVender(char* vender)
{
	FLASH_EEPROM_WriteBuffer(TCFG_FACTORY_VENDER_OFFSET, (unsigned char*)vender, TCFG_FACTORY_VENDER_LENGTH);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_GetVender(char* vender)
 @Description			TCFG_EEPROM_GetVender						: 读取vender
 @Input				&vender
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_GetVender(char* vender)
{
	FLASH_EEPROM_ReadBuffer(TCFG_FACTORY_VENDER_OFFSET, (unsigned char*)vender, TCFG_FACTORY_VENDER_LENGTH);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_Vender_String(void)
 @Description			TCFG_EEPROM_Get_Vender_String					: 读取vender字符串
 @Input				void
 @Return				vender_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_Vender_String(void)
{
	TCFG_EEPROM_GetVender((char *)&TCFG_SystemData.SubVender);
	
	return (char*)TCFG_SystemData.SubVender;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMagMode(uint8_t val)
 @Description			TCFG_EEPROM_SetMagMode						: 保存MagMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMagMode(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_MAG_MODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			uint8_t TCFG_EEPROM_GetMagMode(void)
 @Description			TCFG_EEPROM_GetMagMode						: 读取MagMode
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetMagMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_MAG_MODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetSenseMode(uint8_t val)
 @Description			TCFG_EEPROM_SetSenseMode						: 保存 sense mode
 @Input				val 0=both sensors,1=magnetic only,2=radar only
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetSenseMode(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_SENSE_MODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetSenseMode(void)
 @Description			TCFG_EEPROM_GetSenseMode						: 读取 sense mode
 @Input				void
 @Return				val 0=both sensors,1=magnetic only,2=radar only
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetSenseMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_SENSE_MODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNbiotHeart(uint8_t val)
 @Description			TCFG_EEPROM_SetNbiotHeart					: 保存NbiotHeart
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNbiotHeart(uint8_t val)
{
	if (val == 0) {
		val = 4;
	}
	else if (val > 12) {
		val = 12;
	}
	
	FLASH_EEPROM_WriteByte(TCFG_NB_HEART_OFFSET, val);
}

/**********************************************************************************************************
 @Function			uint8_t TCFG_EEPROM_GetNbiotHeart(void)
 @Description			TCFG_EEPROM_GetNbiotHeart					: 读取NbiotHeart
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetNbiotHeart(void)
{
	unsigned char val = 0;
	
	val = FLASH_EEPROM_ReadByte(TCFG_NB_HEART_OFFSET);
	if (val == 0) {
		val = 4;
	}
	else if (val > 12) {
		val = 12;
	}
	
	return val;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarRange(uint8_t val)
 @Description			TCFG_EEPROM_SetRadarRange					: 保存RadarRange
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarRange(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_RANGE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRadarRange(void)
 @Description			TCFG_EEPROM_GetRadarRange					: 读取RadarRange
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRadarRange(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_RANGE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoverGain(unsigned char val)
 @Description			TCFG_EEPROM_SetCoverGain						: 保存 radar gain in cover
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoverGain(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_COVER_GAIN_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetCoverGain(void)
 @Description			TCFG_EEPROM_GetCoverGain						: 读取 radar gain in cover
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetCoverGain(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_COVER_GAIN_OFFSET); 
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRadarGain(unsigned char val)
 @Description			TCFG_EEPROM_SetRadarGain						: 保存 radar gain
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRadarGain(unsigned char val)
{
	FLASH_EEPROM_WriteByte(TCFG_RADAR_GAIN_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRadarGain(void)
 @Description			TCFG_EEPROM_GetRadarGain						: 读取 radar gain
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRadarGain(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADAR_GAIN_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCarInDelay(uint8_t val)
 @Description			TCFG_EEPROM_SetCarInDelay					: 保存CarInDelay
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCarInDelay(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_CARIN_DELAY_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetCarInDelay(void)
 @Description			TCFG_EEPROM_GetCarInDelay					: 读取CarInDelay
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetCarInDelay(void)
{
	unsigned char val;
	
	val = FLASH_EEPROM_ReadByte(TCFG_CARIN_DELAY_OFFSET);
	if (val < 8) {
		val = 8;
	}
	
	return val;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetRFCmdCnt(uint8_t val)
 @Description			TCFG_EEPROM_SetRFCmdCnt						: 保存RFCmdCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetRFCmdCnt(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_RF_CMDCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetRFCmdCnt(void)
 @Description			TCFG_EEPROM_GetRFCmdCnt						: 读取RFCmdCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetRFCmdCnt(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RF_CMDCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetNBCmdCnt(uint8_t val)
 @Description			TCFG_EEPROM_SetNBCmdCnt						: 保存NBCmdCnt
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetNBCmdCnt(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_NB_CMDCNT_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetNBCmdCnt(void)
 @Description			TCFG_EEPROM_GetNBCmdCnt						: 读取NBCmdCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetNBCmdCnt(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_NB_CMDCNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapRATimeHour(unsigned char val)
 @Description			TCFG_EEPROM_SetCoapRATimeHour					: 保存CoapRATimeHour
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapRATimeHour(unsigned char val)
{
	if (val > 12) val = 12;
	FLASH_EEPROM_WriteByte(TCFG_COAP_RA_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetCoapRATimeHour(void)
 @Description			TCFG_EEPROM_GetCoapRATimeHour					: 读取CoapRATimeHour
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetCoapRATimeHour(void)
{
	unsigned char val8;
	
	val8 = FLASH_EEPROM_ReadByte(TCFG_COAP_RA_TIME_OFFSET);
	if (val8 > 12) val8 = 12;
	
	return val8;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapConnectTime(unsigned int val)
 @Description			TCFG_EEPROM_SetCoapConnectTime				: 保存CoapConnectTime
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapConnectTime(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_COAP_CON_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCoapConnectTime(void)
 @Description			TCFG_EEPROM_GetCoapConnectTime				: 读取CoapConnectTime
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCoapConnectTime(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_COAP_CON_TIME_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetCoapIdleTime(unsigned int val)
 @Description			TCFG_EEPROM_SetCoapIdleTime					: 保存CoapIdleTime
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetCoapIdleTime(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_COAP_IDLE_TIME_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetCoapIdleTime(void)
 @Description			TCFG_EEPROM_GetCoapIdleTime					: 读取CoapIdleTime
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetCoapIdleTime(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_COAP_IDLE_TIME_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetUpgradeLimitRssi(short val)
 @Description			TCFG_EEPROM_SetUpgradeLimitRssi				: 保存UpgradeLimitRssi
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetUpgradeLimitRssi(short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_UPDATA_LIMITRSSI_OFFSET, val);
}

/**********************************************************************************************************
 @Function			short TCFG_EEPROM_GetUpgradeLimitRssi(void)
 @Description			TCFG_EEPROM_GetUpgradeLimitRssi				: 读取UpgradeLimitRssi
 @Input				void
 @Return				val
**********************************************************************************************************/
short TCFG_EEPROM_GetUpgradeLimitRssi(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_UPDATA_LIMITRSSI_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetUpgradeLimitSnr(short val)
 @Description			TCFG_EEPROM_SetUpgradeLimitSnr				: 保存UpgradeLimitSnr
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetUpgradeLimitSnr(short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_UPDATA_LIMITSNR_OFFSET, val);
}

/**********************************************************************************************************
 @Function			short TCFG_EEPROM_GetUpgradeLimitSnr(void)
 @Description			TCFG_EEPROM_GetUpgradeLimitSnr				: 读取UpgradeLimitSnr
 @Input				void
 @Return				val
**********************************************************************************************************/
short TCFG_EEPROM_GetUpgradeLimitSnr(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_UPDATA_LIMITSNR_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetBeepOff(uint8_t val)
 @Description			TCFG_EEPROM_SetBeepOff						: 保存BeepOff
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetBeepOff(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_BEEP_OFF_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetBeepOff(void)
 @Description			TCFG_EEPROM_GetBeepOff						: 读取BeepOff
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetBeepOff(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_BEEP_OFF_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetDeviceRbtMode(uint8_t val)
 @Description			TCFG_EEPROM_SetDeviceRbtMode					: 保存DeviceRbtMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetDeviceRbtMode(uint8_t val)
{
	FLASH_EEPROM_WriteByte(TCFG_DEVICE_RBTMODE_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetDeviceRbtMode(void)
 @Description			TCFG_EEPROM_GetDeviceRbtMode					: 读取DeviceRbtMode
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetDeviceRbtMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_DEVICE_RBTMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMqttSNIP(unsigned int val)
 @Description			TCFG_EEPROM_SetMqttSNIP						: 保存MqttSNIP
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMqttSNIP(unsigned int val)
{
	FLASH_EEPROM_WriteWord(TCFG_MQTTSN_SERVER_OFFSET, val);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetMqttSNIP(void)
 @Description			TCFG_EEPROM_GetMqttSNIP						: 读取MqttSNIP
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetMqttSNIP(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_MQTTSN_SERVER_OFFSET);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetMqttSNPort(unsigned short val)
 @Description			TCFG_EEPROM_SetMqttSNPort					: 保存MqttSNPort
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetMqttSNPort(unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(TCFG_MQTTSN_SERVER_OFFSET + 4, val);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetMqttSNPort(void)
 @Description			TCFG_EEPROM_GetMqttSNPort					: 读取MqttSNPort
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetMqttSNPort(void)
{
	return FLASH_EEPROM_ReadHalfWord(TCFG_MQTTSN_SERVER_OFFSET + 4);
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MqttSNIP_String(void)
 @Description			TCFG_EEPROM_Get_MqttSNIP_String				: 读取MqttSNIP字符串
 @Input				void
 @Return				MqttSNIP_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MqttSNIP_String(void)
{
	TCFG_SystemData.NBMqttSNServer.ip.ip32 = TCFG_EEPROM_GetMqttSNIP();
	
