gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	memset((void*)&TCFG_SystemData.NBMqttSNServerIP, 0, sizeof(TCFG_SystemData.NBMqttSNServerIP));
	sprintf((char *)TCFG_SystemData.NBMqttSNServerIP, "%d.%d.%d.%d", 
	TCFG_SystemData.NBMqttSNServer.ip.ip8[3], TCFG_SystemData.NBMqttSNServer.ip.ip8[2], 
	TCFG_SystemData.NBMqttSNServer.ip.ip8[1], TCFG_SystemData.NBMqttSNServer.ip.ip8[0]);
	
	return (char *)TCFG_SystemData.NBMqttSNServerIP;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MqttSNPort_String(void)
 @Description			TCFG_EEPROM_Get_MqttSNPort_String				: 读取MqttSNPort字符串
 @Input				void
 @Return				MqttSNPort_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MqttSNPort_String(void)
{
	TCFG_SystemData.NBMqttSNServer.port = TCFG_EEPROM_GetMqttSNPort();
	
	memset((void*)&TCFG_SystemData.NBMqttSNServerPort, 0, sizeof(TCFG_SystemData.NBMqttSNServerPort));
	sprintf((char *)TCFG_SystemData.NBMqttSNServerPort, "%d", TCFG_SystemData.NBMqttSNServer.port);
	
	return (char *)TCFG_SystemData.NBMqttSNServerPort;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Device_BootCount(void)
 @Description			TCFG_Utility_Add_Device_BootCount				: Device重启次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Device_BootCount(void)
{
	TCFG_SystemData.DeviceBootCount = TCFG_EEPROM_GetDevBootCnt() + 1;
	TCFG_EEPROM_SetDevBootCnt(TCFG_SystemData.DeviceBootCount);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Device_BootCount(void)
 @Description			TCFG_Utility_Get_Device_BootCount				: Device重启次数获取
 @Input				void
 @Return				Device_BootCount
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Device_BootCount(void)
{
	return TCFG_SystemData.DeviceBootCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Nbiot_BootCount(void)
 @Description			TCFG_Utility_Add_Nbiot_BootCount				: NBIot重启次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Nbiot_BootCount(void)
{
	TCFG_SystemData.NBIotBootCount++;
	if (TCFG_SystemData.NBIotBootCount > (10 + TCFG_EEPROM_GetNbiotBootCnt())) {
		TCFG_EEPROM_SetNbiotBootCnt(TCFG_SystemData.NBIotBootCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_BootCount(void)
 @Description			TCFG_Utility_Get_Nbiot_BootCount				: NBIot重启次数获取
 @Input				void
 @Return				Nbiot_BootCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_BootCount(void)
{
	return TCFG_SystemData.NBIotBootCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Coap_SentCount(void)
 @Description			TCFG_Utility_Add_Coap_SentCount				: NBIot Coap发送次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Coap_SentCount(void)
{
	TCFG_SystemData.CoapSentCount++;
	if (TCFG_SystemData.CoapSentCount > (10 + TCFG_EEPROM_GetCoapSentCnt())) {
		TCFG_EEPROM_SetCoapSentCnt(TCFG_SystemData.CoapSentCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Coap_SentCount(void)
 @Description			TCFG_Utility_Get_Coap_SentCount				: NBIot Coap发送次数获取
 @Input				void
 @Return				Coap_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Coap_SentCount(void)
{
	return TCFG_SystemData.CoapSentCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_Coap_RecvCount(void)
 @Description			TCFG_Utility_Add_Coap_RecvCount				: NBIot Coap接收次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_Coap_RecvCount(void)
{
	TCFG_SystemData.CoapRecvCount++;
	if (TCFG_SystemData.CoapRecvCount > (10 + TCFG_EEPROM_GetCoapRecvCnt())) {
		TCFG_EEPROM_SetCoapRecvCnt(TCFG_SystemData.CoapRecvCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Coap_RecvCount(void)
 @Description			TCFG_Utility_Get_Coap_RecvCount				: NBIot Coap接收次数获取
 @Input				void
 @Return				Coap_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Coap_RecvCount(void)
{
	return TCFG_SystemData.CoapRecvCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_MqttSN_SentCount(void)
 @Description			TCFG_Utility_Add_MqttSN_SentCount				: NBIot MqttSN发送次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_MqttSN_SentCount(void)
{
	TCFG_SystemData.MqttSNSentCount++;
	if (TCFG_SystemData.MqttSNSentCount > (10 + TCFG_EEPROM_GetMqttSNSentCnt())) {
		TCFG_EEPROM_SetMqttSNSentCnt(TCFG_SystemData.MqttSNSentCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_MqttSN_SentCount(void)
 @Description			TCFG_Utility_Get_MqttSN_SentCount				: NBIot MqttSN发送次数获取
 @Input				void
 @Return				MqttSN_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_MqttSN_SentCount(void)
{
	return TCFG_SystemData.MqttSNSentCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_MqttSN_RecvCount(void)
 @Description			TCFG_Utility_Add_MqttSN_RecvCount				: NBIot MqttSN接收次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_MqttSN_RecvCount(void)
{
	TCFG_SystemData.MqttSNRecvCount++;
	if (TCFG_SystemData.MqttSNRecvCount > (10 + TCFG_EEPROM_GetMqttSNRecvCnt())) {
		TCFG_EEPROM_SetMqttSNRecvCnt(TCFG_SystemData.MqttSNRecvCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_MqttSN_RecvCount(void)
 @Description			TCFG_Utility_Get_MqttSN_RecvCount				: NBIot MqttSN接收次数获取
 @Input				void
 @Return				MqttSN_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_MqttSN_RecvCount(void)
{
	return TCFG_SystemData.MqttSNRecvCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_OneNET_SentCount(void)
 @Description			TCFG_Utility_Add_OneNET_SentCount				: NBIot OneNET发送次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_OneNET_SentCount(void)
{
	TCFG_SystemData.OneNETSentCount++;
	if (TCFG_SystemData.OneNETSentCount > (10 + TCFG_EEPROM_GetOneNETSentCnt())) {
		TCFG_EEPROM_SetOneNETSentCnt(TCFG_SystemData.OneNETSentCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_OneNET_SentCount(void)
 @Description			TCFG_Utility_Get_OneNET_SentCount				: NBIot OneNET发送次数获取
 @Input				void
 @Return				OneNET_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_OneNET_SentCount(void)
{
	return TCFG_SystemData.OneNETSentCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Add_OneNET_RecvCount(void)
 @Description			TCFG_Utility_Add_OneNET_RecvCount				: NBIot OneNET接收次数累加
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Add_OneNET_RecvCount(void)
{
	TCFG_SystemData.OneNETRecvCount++;
	if (TCFG_SystemData.OneNETRecvCount > (10 + TCFG_EEPROM_GetOneNETRecvCnt())) {
		TCFG_EEPROM_SetOneNETRecvCnt(TCFG_SystemData.OneNETRecvCount);
	}
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_OneNET_RecvCount(void)
 @Description			TCFG_Utility_Get_OneNET_RecvCount				: NBIot OneNET接收次数获取
 @Input				void
 @Return				OneNET_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_OneNET_RecvCount(void)
{
	return TCFG_SystemData.OneNETRecvCount;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Set_Nbiot_IdleLifetime(unsigned short val)
 @Description			TCFG_Utility_Set_Nbiot_IdleLifetime			: NBIot 休眠模式保活时间设置
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Set_Nbiot_IdleLifetime(unsigned short val)
{
	TCFG_SystemData.NBIdleLifetime = (val > 30) ? 30 : val;
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Nbiot_IdleLifetime(void)
 @Description			TCFG_Utility_Get_Nbiot_IdleLifetime			: NBIot 休眠模式保活时间获取
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Nbiot_IdleLifetime(void)
{
	return TCFG_SystemData.NBIdleLifetime;
}

/**********************************************************************************************************
 @Function			void TCFG_Utility_Sub_Nbiot_IdleLifetime(void)
 @Description			TCFG_Utility_Sub_Nbiot_IdleLifetime			: NBIot 休眠模式保活时间递减
 @Input				void
 @Return				void
**********************************************************************************************************/
void TCFG_Utility_Sub_Nbiot_IdleLifetime(void)
{
	if (TCFG_SystemData.NBIdleLifetime > 0) {
		TCFG_SystemData.NBIdleLifetime--;
	}
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Iccid_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Iccid_String			: 读取Nbiot Iccid字符串
 @Input				void
 @Return				Nbiot_Iccid
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Iccid_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.iccid;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.iccid;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.iccid;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Imei_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Imei_String				: 读取Nbiot Imei字符串
 @Input				void
 @Return				Nbiot_Imei
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Imei_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.imei;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.imei;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.imei;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Imeisv_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Imeisv_String			: 读取Nbiot Imeisv字符串
 @Input				void
 @Return				Nbiot_Imeisv
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Imeisv_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.imeisv;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.imeisv;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.imeisv;
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Nbiot_Imsi_String(void)
 @Description			TCFG_Utility_Get_Nbiot_Imsi_String				: 读取Nbiot Imesi字符串
 @Input				void
 @Return				Nbiot_Imsi
**********************************************************************************************************/
char* TCFG_Utility_Get_Nbiot_Imsi_String(void)
{
#if NETPROTOCAL == NETCOAP
	return (char*)NbiotClientHandler.Parameter.imsi;
#elif NETPROTOCAL == NETMQTTSN
	return (char*)MqttSNClientHandler.SocketStack->NBIotStack->Parameter.imsi;
#elif NETPROTOCAL == NETONENET
	return (char*)OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.imsi;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_Rssi_IntVal(void)
 @Description			TCFG_Utility_Get_Nbiot_Rssi_IntVal				: 读取Nbiot Rssi值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_Rssi_IntVal(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.rssi;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.rssi;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_Rssi_UnCharVal(void)
 @Description			TCFG_Utility_Get_Nbiot_Rssi_UnCharVal			: 读取Nbiot Rssi值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_Rssi_UnCharVal(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.rssi;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.rssi;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.rssi;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_WorkMode(void)
 @Description			TCFG_Utility_Get_Nbiot_WorkMode				: 读取Nbiot WorkMode值
 @Input				void
 @Return				Nbiot_Rssi
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_WorkMode(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.connectedstate;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.connectedstate;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.connectedstate;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_Registered(void)
 @Description			TCFG_Utility_Get_Nbiot_Registered				: 读取Nbiot Registered值
 @Input				void
 @Return				Nbiot_Registered
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_Registered(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Registered;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Registered;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Registered;
#endif
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Nbiot_NetStateIdentification(void)
 @Description			TCFG_Utility_Get_Nbiot_NetStateIdentification		: 读取Nbiot NetStateIdentification值
 @Input				void
 @Return				Nbiot_NetStateIdentification
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Nbiot_NetStateIdentification(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.NetStateIdentification;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->NetStateIdentification;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->NetStateIdentification;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusTac(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegStatusTac		: 读取Nbiot NetworkRegStatusTac值
 @Input				void
 @Return				NetworkRegStatusTac
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusTac(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.tac;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.tac;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusCellID(void)
 @Description			TCFG_Utility_Get_Nbiot_NetworkRegStatusCellID	: 读取Nbiot NetworkRegStatusCellID值
 @Input				void
 @Return				NetworkRegStatusCellID
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_NetworkRegStatusCellID(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.networkRegStatus.cellID;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.networkRegStatus.cellID;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioSignalpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioSignalpower			: 读取Nbiot RadioSignalpower值
 @Input				void
 @Return				RadioSignalpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioSignalpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.Signalpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.Signalpower;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.Signalpower;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioTotalpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTotalpower			: 读取Nbiot RadioTotalpower值
 @Input				void
 @Return				RadioTotalpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioTotalpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.Totalpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.Totalpower;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.Totalpower;
#endif
}

/**********************************************************************************************************
 @Function			int TCFG_Utility_Get_Nbiot_RadioTXpower(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTXpower			: 读取Nbiot RadioTXpower值
 @Input				void
 @Return				RadioTXpower
**********************************************************************************************************/
int TCFG_Utility_Get_Nbiot_RadioTXpower(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.TXpower;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.TXpower;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.TXpower;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioTXtime(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioTXtime				: 读取Nbiot RadioTXtime值
 @Input				void
 @Return				RadioTXtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioTXtime(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.TXtime;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.TXtime;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.TXtime;
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
 @Description			TCFG_Utility_Get_Nbiot_RadioRXtime				: 读取Nbiot RadioRXtime值
 @Input				void
 @Return				RadioRXtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RadioRXtime(void)
{
#if NETPROTOCAL == NETCOAP
	return NbiotClientHandler.Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETMQTTSN
	return MqttSNClientHandler.SocketStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#elif NETPROTOCAL == NETONENET
	return OneNETClientHandler.LWM2MStack->NBIotStack->Parameter.statisticsRADIO.RXtime;
#endif
}

