gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_SentCount(void)
 @Description			TCFG_Utility_Get_Nbiot_SentCount				: 读取Nbiot SentCount值
 @Input				void
 @Return				Nbiot_SentCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_SentCount(void)
{
#if NETPROTOCAL == NETCOAP
	return TCFG_Utility_Get_Coap_SentCount();
#elif NETPROTOCAL == NETMQTTSN
	return TCFG_Utility_Get_MqttSN_SentCount();
#elif NETPROTOCAL == NETONENET
	return TCFG_Utility_Get_OneNET_SentCount();
#endif
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Nbiot_RecvCount(void)
 @Description			TCFG_Utility_Get_Nbiot_RecvCount				: 读取Nbiot RecvCount值
 @Input				void
 @Return				Nbiot_RecvCount
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Nbiot_RecvCount(void)
{
#if NETPROTOCAL == NETCOAP
	return TCFG_Utility_Get_Coap_RecvCount();
#elif NETPROTOCAL == NETMQTTSN
	return TCFG_Utility_Get_MqttSN_RecvCount();
#elif NETPROTOCAL == NETONENET
	return TCFG_Utility_Get_OneNET_RecvCount();
#endif
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Device_Batt_ShortVal(void)
 @Description			TCFG_Utility_Get_Device_Batt_ShortVal			: 读取Device Batt值
 @Input				void
 @Return				Device_Batt
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Device_Batt_ShortVal(void)
{
	return VBAT_ADC_Read(1000);
}

/**********************************************************************************************************
 @Function			short TCFG_Utility_Get_Device_Temperature(void)
 @Description			TCFG_Utility_Get_Device_Temperature			: 读取Device Temperature值
 @Input				void
 @Return				Device_Temperature
**********************************************************************************************************/
short TCFG_Utility_Get_Device_Temperature(void)
{
	return TEMPERATURE_ADC_Read(1000);
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Build_Time_String(void)
 @Description			TCFG_Utility_Get_Build_Time_String				: 读取Build Time字符串
 @Input				void
 @Return				buildtime_string
**********************************************************************************************************/
char* TCFG_Utility_Get_Build_Time_String(void)
{
	char bulidData[12];
	
	memset(bulidData, 0x0, sizeof(bulidData));
	memset((void*)&TCFG_SystemData.BuildTime, 0, sizeof(TCFG_SystemData.BuildTime));
	
	memcpy(bulidData, __DATE__, 12);
	if (!memcmp(&bulidData[0], "Jan", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '1';
	}
	else	if (!memcmp(&bulidData[0], "Feb", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '2';
	}
	else if (!memcmp(&bulidData[0], "Mar", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '3';
	}
	else if(!memcmp(&bulidData[0], "Apr", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '4';
	}
	else if (!memcmp(&bulidData[0], "May", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '5';
	}
	else if (!memcmp(&bulidData[0], "Jun", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '6';
	}
	else if (!memcmp(&bulidData[0], "Jul", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '7';
	}
	else if (!memcmp(&bulidData[0], "Aug", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '8';
	}
	else if (!memcmp(&bulidData[0], "Sep", 3)) {
		TCFG_SystemData.BuildTime[5] = '0';
		TCFG_SystemData.BuildTime[6] = '9';
	}
	else if (!memcmp(&bulidData[0], "Oct", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '0';
	}
	else if (!memcmp(&bulidData[0], "Nov", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '1';
	}
	else if (!memcmp(&bulidData[0], "Dec", 3)) {
		TCFG_SystemData.BuildTime[5] = '1';
		TCFG_SystemData.BuildTime[6] = '2';
	}
	
	memcpy(TCFG_SystemData.BuildTime, &bulidData[7], 4);
	memcpy(&TCFG_SystemData.BuildTime[8], &bulidData[4], 2);
	TCFG_SystemData.BuildTime[4] = '-';
	TCFG_SystemData.BuildTime[7] = '-';
  	TCFG_SystemData.BuildTime[11] = '\0';
	
	return (char*)TCFG_SystemData.BuildTime;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Run_Time(void)
 @Description			TCFG_Utility_Get_Run_Time					: 读取系统运行时间
 @Input				void
 @Return				runtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Run_Time(void)
{
	return Stm32_GetSecondTick();
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Mvb_ModelType(void)
 @Description			TCFG_Utility_Get_Mvb_ModelType				: 读取设备类型
 @Input				void
 @Return				ModelType
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Mvb_ModelType(void)
{
	return MVB_MODEL_TYPE;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_RadarLibNum(void)
 @Description			TCFG_Utility_Get_RadarLibNum					: 读取雷达库版本号
 @Input				void
 @Return				RadarLibNum
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_RadarLibNum(void)
{
	return tradar_get_lib_num();
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_AlgoLibNum(void)
 @Description			TCFG_Utility_Get_AlgoLibNum					: 读取检测算法库版本号
 @Input				void
 @Return				RadarLibNum
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_AlgoLibNum(void)
{
	return talgo_get_lib_num();
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_SoftResetFlag(void)
 @Description			TCFG_Utility_Get_SoftResetFlag				: 读取设备重启标识符
 @Input				void
 @Return				SoftResetFlag
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_SoftResetFlag(void)
{
	return SoftResetFlag;
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_ReInitModuleCount(void)
 @Description			TCFG_Utility_Get_ReInitModuleCount				: 读取模块异常初始化次数
 @Input				void
 @Return				ReInitModuleCount
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_ReInitModuleCount(void)
{
	return ReInitModuleGetCnt();
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_DistanceRange(void)
 @Description			TCFG_Utility_Get_DistanceRange				: 读取雷达检测范围
 @Input				void
 @Return				DistanceRange
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_DistanceRange(void)
{
	return tradar_get_distance_range() - 4;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_GainCover(void)
 @Description			TCFG_Utility_Get_GainCover					: 读取雷达覆水增益
 @Input				void
 @Return				GainCover
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_GainCover(void)
{
	return tradar_get_gain_in_cover();
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_RadioGatewayNearby(void)
 @Description			TCFG_Utility_Get_RadioGatewayNearby			: 读取小无线网关接收值
 @Input				void
 @Return				RadioGatewayNearby
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_RadioGatewayNearby(void)
{
	return (gateway_nearby > 10) ? 1 : 0;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Major_Softnumber(void)
 @Description			TCFG_Utility_Get_Major_Softnumber				: 读取Major_Softnumber
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Major_Softnumber(void)
{
	return SOFTWAREMAJOR + NETPROTOCAL + NETCARRIERTYPE;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Sub_Softnumber(void)
 @Description			TCFG_Utility_Get_Sub_Softnumber				: 读取Sub_Softnumber
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Sub_Softnumber(void)
{
	return SOFTWARESUB;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Major_Hardnumber(void)
 @Description			TCFG_Utility_Get_Sub_Hardnumber				: 读取Major_Hardnumber
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Major_Hardnumber(void)
{
#if RADAR_MODEL_TYPE == RADAR_MODEL_V1
	return HARDWAREMAJOR_V1;
#elif RADAR_MODEL_TYPE == RADAR_MODEL_V2
	return HARDWAREMAJOR_V2;
#else
	#error RADAR_MODEL_TYPE Define Error
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Softwear_Version_String(void)
 @Description			TCFG_Utility_Get_Softwear_Version_String			: 读取Softwear Version字符串
 @Input				void
 @Return				Softwear_Version_String
**********************************************************************************************************/
char* TCFG_Utility_Get_Softwear_Version_String(void)
{
	memset((void*)&TCFG_SystemData.SoftVersion, 0, sizeof(TCFG_SystemData.SoftVersion));
	
