gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	sprintf((char*)TCFG_SystemData.SoftVersion, "%d:%d.%d", \
		TCFG_EEPROM_GetBootVersion(), TCFG_Utility_Get_Major_Softnumber(), TCFG_Utility_Get_Sub_Softnumber());
	
	return (char*)TCFG_SystemData.SoftVersion;
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Hardwear_Version_String(void)
 @Description			TCFG_Utility_Get_Hardwear_Version_String			: 读取Hardwear Version字符串
 @Input				void
 @Return				Hadrwear_Version_String
**********************************************************************************************************/
char* TCFG_Utility_Get_Hardwear_Version_String(void)
{
	memset((void*)&TCFG_SystemData.HardVersion, 0, sizeof(TCFG_SystemData.HardVersion));
	
#if RADAR_MODEL_TYPE == RADAR_MODEL_V1
	if (Radio_Rf_get_Status() == TRF_OK) {
		if (GD25Q_SPIFLASH_Get_Status() == GD25Q80CSIG_OK) {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB-RF-GD25", CPUVERSION);
		}
		else {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB-RF", CPUVERSION);
		}
	}
	else {
		if (GD25Q_SPIFLASH_Get_Status() == GD25Q80CSIG_OK) {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB-GD25", CPUVERSION);
		}
		else {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB", CPUVERSION);
		}
	}
#elif RADAR_MODEL_TYPE == RADAR_MODEL_V2
	if (Radio_Rf_get_Status() == TRF_OK) {
		if (GD25Q_SPIFLASH_Get_Status() == GD25Q80CSIG_OK) {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB-RF-GD25-RV2", CPUVERSION);
		}
		else {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB-RF-RV2", CPUVERSION);
		}
	}
	else {
		if (GD25Q_SPIFLASH_Get_Status() == GD25Q80CSIG_OK) {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB-GD25-RV2", CPUVERSION);
		}
		else {
			sprintf((char*)TCFG_SystemData.HardVersion, "%s-NB-RV2", CPUVERSION);
		}
	}
#else
	#error RADAR_MODEL_TYPE Define Error
#endif
	
	return (char*)TCFG_SystemData.HardVersion;
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetStandardByte(unsigned int Address, unsigned char val)
 @Description			TCFG_EEPROM_SetStandardByte
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetStandardByte(unsigned int Address, unsigned char val)
{
	FLASH_EEPROM_WriteByte(Address, val);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetStandardHalfWord(unsigned int Address, unsigned short val)
 @Description			TCFG_EEPROM_SetStandardHalfWord
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetStandardHalfWord(unsigned int Address, unsigned short val)
{
	FLASH_EEPROM_WriteHalfWord(Address, val);
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_SetStandardWord(unsigned int Address, unsigned int val)
 @Description			TCFG_EEPROM_SetStandardWord
 @Input				val
 @Return				void
**********************************************************************************************************/
void TCFG_EEPROM_SetStandardWord(unsigned int Address, unsigned int val)
{
	FLASH_EEPROM_WriteWord(Address, val);
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_EEPROM_GetStandardByte(unsigned int Address)
 @Description			TCFG_EEPROM_GetStandardByte
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_EEPROM_GetStandardByte(unsigned int Address)
{
	return FLASH_EEPROM_ReadByte(Address);
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_EEPROM_GetStandardHalfWord(unsigned int Address)
 @Description			TCFG_EEPROM_GetStandardHalfWord
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned short TCFG_EEPROM_GetStandardHalfWord(unsigned int Address)
{
	return FLASH_EEPROM_ReadHalfWord(Address);
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_EEPROM_GetStandardWord(unsigned int Address)
 @Description			TCFG_EEPROM_GetStandardWord
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned int TCFG_EEPROM_GetStandardWord(unsigned int Address)
{
	return FLASH_EEPROM_ReadWord(Address);
}

/********************************************** END OF FLEE **********************************************/
